# Copyright [2021] [Cargill, Incorporated.] 
# SPDX-License-Identifier: Apache-2.0
input {
  pipeline {
    address => VAR_PIPELINE_NAME
  }
}
filter {
  split {
    field => "records"
  }
  json {
    source => "message"
    target => "az"
  }
  mutate {
    add_field => {"[log][source][hostname]" => "eventhub_azure_atp"}
    add_field => { "[event][module]" => "eventhub azure atp" }
    add_field => { "[event][dataset]" => "security logs" }
    add_field => { "[observer][vendor]" => "microsoft" }
    add_field => { "[observer][product]" => "advanced threat protection" }
    add_field => { "[observer][type]" => "eventhub" }
  }
  mutate {
    rename => {"[az][time]" => "[event][ingested]" }
    rename => {"[az][tenantId]" => "[cloud][account][id]" }
    rename => {"[az][operationName]" => "[event][action]" }
    rename => {"[az][category]" => "[event][dataset]" }
    rename => {"[az][properties][ActionType]" => "[event][outcome]" }
    rename => {"[az][properties][AdditionalFields]" => "[event][original]" }
    rename => {"[az][properties][AppGuardContainerId]" => "container.id" }
    rename => {"[az][properties][DeviceId]" => "[cloud][instance][id]" }
    rename => {"[az][properties][DeviceName]" => "[cloud][instance][name]" }
    rename => {"[az][properties][FileName]" => "[file][name]" }
    rename => {"[az][properties][FileOriginIP]" => "[source][ip]" }
    rename => {"[az][properties][FileOriginReferrerUrl]" => "[http][request][referrer]" }
    rename => {"[az][properties][FileOriginUrl]" => "[url][full]" }
    rename => {"[az][properties][FileSize]" => "file.size" }
    rename => {"[az][properties][FolderPath]" => "[file][path]" }
    rename => {"[az][properties][InitiatingProcessAccountDomain]" => "user.domain" }
    rename => {"[az][properties][InitiatingProcessAccountName]" => "[user][name]" }
    rename => {"[az][properties][InitiatingProcessCommandLine]" => "process.command_line" }
    rename => {"[az][properties][InitiatingProcessCreationTime]" => "process.start" }
    rename => {"[az][properties][InitiatingProcessFileName]" => "[process][name]" }
    rename => {"[az][properties][InitiatingProcessId]" => "[process][pid]" }
    rename => {"[az][properties][InitiatingProcessMD5]" => "process.hash.md5" }
    rename => {"[az][properties][InitiatingProcessParentCreationTime]" => "process.parent.start" }
    rename => {"[az][properties][InitiatingProcessParentFileName]" => "process.parent.name" }
    rename => {"[az][properties][InitiatingProcessParentId]" => "process.parent.pid" }
    rename => {"[az][properties][InitiatingProcessSHA1]" => "process.parent.hash.sha1" }
    rename => {"[az][properties][InitiatingProcessSHA256]" => "process.parent.hash.sha256" }
    rename => {"[az][properties][MD5]" => "file.hash.md5" }
    rename => {"[az][properties][ReportId]" => "rule.id" }
    rename => {"[az][properties][RequestAccountDomain]" => "source.user.domain" }
    rename => {"[az][properties][RequestAccountName]" => "source.[user][id]" }
    rename => {"[az][properties][RequestAccountSid]" => "alarm.id" }
    rename => {"[az][properties][RequestProtocol]" => "network.protocol" }
    rename => {"[az][properties][RequestSourceIP]" => "[source][ip]" }
    rename => {"[az][properties][RequestSourcePort]" => "[source][port]" }
    rename => {"[az][properties][SHA1]" => "file.hash.sha1" }
    rename => {"[az][properties][SHA256]" => "file.hash.sha256" }
    rename => {"[az][properties][Timestamp]" => "[event][created]" }
    rename => {"[az][properties][initiatingprocessversioninfocompanyname]" => "process.pe.company" }
    rename => {"[az][properties][initiatingprocessversioninfoproductname]" => "process.pe.description" }
    rename => {"[az][properties][initiatingprocessversioninfoproductversion]" => "process.pe.file_version" }
    rename => {"[az][properties][initiatingprocessversioninfointernalfilename]" => "process.pe.original_file_name" }
    rename => {"[az][properties][initiatingprocessversioninfooriginalfilename]" => "process.pe.original_file_name" }
    rename => {"[az][properties][initiatingprocessversioninfofiledescription]" => "process.pe.description" }
  }

  # 2021-03-05t14:03:07.5066374z [event][created]
  date {
    match => ["[event][created]","ISO8601"]
    timezone => "GMT"
    locale => "en"
    target => "[event][created]"
    tag_on_failure => "_dateparsefailure_ec"
  }
  if "_dateparsefailure_ec" in [tags] {
    if ![log.orignal] {
      mutate {
        copy => { "message" => "[log][original]" }
      }
    }
    mutate {
      remove_field => ["[event][created]"]
    }
  }
  # 2021-03-05t13:40:07.5041487z process.parent.start
  date {
    match => ["process.parent.start","ISO8601"]
    timezone => "GMT"
    locale => "en"
    target => "process.parent.start"
    tag_on_failure => "_dateparsefailure_pps"
  }
  if "_dateparsefailure_pps" in [tags] {
    if ![log.orignal] {
      mutate {
        copy => { "message" => "[log][original]" }
      }
    }
    mutate {
      remove_field => ["process.parent.start"]
    }
  }
  # 2021-03-05t13:40:20.08z process.start
  date {
    match => ["process.start","ISO8601"]
    timezone => "GMT"
    locale => "en"
    target => "process.start"
    tag_on_failure => "_dateparsefailure_ps"
  }
  if "_dateparsefailure_ps" in [tags] {
    if ![log.orignal] {
      mutate {
        copy => { "message" => "[log][original]" }
      }
    }
  }
  mutate {
    remove_field => ["process.start", "az"]
  }
}
output {
  pipeline { send_to => [enrichments] }
}
